stanford-dine/app/controllers/welcome_controller.rb

SELECT "halls".* FROM "halls"
---
  def index
    @halls = Hall.all